Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: If you have just one ROM module, ignore this input.
ru_ru: Если у вас только один модуль ПЗУ, игнорируйте этот вход.

source: But if you change the input to 1, the circuit will effectively enter an infinite loop.
ru_ru: Но если вы измените значение на входе на 1, то схема фактически войдёт в бесконечный цикл.

source: Clock - when triggered while the write-enable pin isn't 0, the current ASCII value on the Data input is processed by the terminal.
ru_ru: Тактовый вход - когда срабатывает при ненулевом значении на контакте Разрешение записи, текущее ASCII значение на входе Данные обрабатывается терминалом.

source: Select the text tool ().
ru_ru: Выберите Инструмент Текст ().

source: For an input pin, this configures whether the user can instruct the pin to emit unspecified (i.e., floating) values.
ru_ru: Для входного контакта этот атрибут определяет, может ли пользователь заставить контакт подать на выход неопределённые (например плавающие) значения.

source: Three-state?
ru_ru: Три состояния?

source: Note that
ru_ru: Обратите внимание, что

source: Options include zero and floating; in the latter case, the output is effectively disconnected from any other ports.
ru_ru: Существуют варианты "ноль" и "плавающее"; в последнем случае выход фактически отключен от всех других контактов.

source: But if the circuit uses some non-gate components (such as a multiplexer), or if the circuit is more than 100 levels deep (unlikely), then it will pop up a dialog box telling you that deriving Boolean expressions was impossible, and Logisim will instead derive the expressions based on the truth table, which will be derived by quietly trying each combination of inputs and reading the resulting outputs.
ru_ru: Но если схема использует какие-то компоненты, отличные от логических элементов (такие как мультиплексор), или если схема имеет более ста уровней в глубину (маловероятно), то всплывёт диалоговое окно, сообщающее вам, что составление логических выражений невозможно, и вместо этого Logisim будет составлять выражения на основе таблицы истинности, которая будет составлена перебором всех комбинаций значений на входах и считыванием значений с выходов.

source: The carry bit computed for the sum.
ru_ru: Бит переноса, вычисленный для суммы.

source: We've farmed this out to a helper method,
ru_ru: Мы передали эту работу вспомогательному методу,

source: (The minuend is the first operand (upper input) to the subtraction, and the subtrahend is the second (lower input).
ru_ru: (Уменьшаемое - это первый операнд (верхний вход) вычитания, а вычитаемое - второй (нижний вход).

source: Normally, the value can be controlled via the inputs to the west side.
ru_ru: В нормальном состоянии значением можно управлять через входы на западном крае.

source: The Distribute Ascending option distributes the bits so that each split end receives the same number of bits, starting from end 0.
ru_ru: Вариант "Расставить по возрастанию" расставляет биты так, что каждый разъединённый конец принимает одинаковое количество битов, начиная с конца 0.

source: Clock: At the instant that this is triggered as specified by the Trigger attribute, the counter updates as indicated by the load and count inputs.
ru_ru: Тактовый вход: в момент срабатывания этого входа (как указано в атрибуте Срабатывание) значение счётчика обновляется, как указано входами загрузка и счёт.

source: (Incidentally, some authorities spell this multiplexor, but multiplexer is the predominant spelling.)
ru_ru: (Кстати, на английском некоторые специалисты пишут multiplexor, но multiplexer является преобладающим написанием.)

source: * Logisim except that it manipulates Value and BitWidth objects.
ru_ru: * Logisim, за исключением того, что он манипулирует с объектами Value и BitWidth.

source: Tutorial: Testing your circuit
ru_ru: Пособие: Проверка вашей схемы

source: However, nothing else grants you permission to modify or distribute the Program or its derivative works.
ru_ru: Однако тогда вы не получаете права модифицировать или распространять Программу или основанные на Программе произведения.

source: Then click the AND tool again and place the second AND gate below it.
ru_ru: Затем нажмите на инструмент Элемент И снова и поместите второй элемент И под первым.

source: Note: Many authorities contend that the shaped XOR gate's behavior should correspond to the odd parity gate, but there is not agreement on this point.
ru_ru: Примечание: многие специалисты утверждают, что поведение фигурного элемента Исключающее ИЛИ должно соответствовать поведению элемента Нечётность, но по этому вопросу нет согласия.

source: General information for those developing third-party libraries.
ru_ru: Общая информация по разработке сторонних библиотек.

source: Image Format: You can create PNG, GIF, and JPEG files.
ru_ru: Формат изображения: Вы можете создавать PNG, GIF и JPEG файлы.

source: When a store is requested (via the clock changing from 0 to 1 while sel and str are both 1 or floating), the value found at this port is stored into memory at the currently selected address.
ru_ru: Когда запрошена запись (через изменение значения на тактовом входе с 0 на 1, пока на входах sel и str 1 или плавающее значение), значение, поданное на этот порт, записывается в память по выбранному в данный момент адресу.

source: Control Line Location
ru_ru: Расположение управляющего входа

source: New
ru_ru: Новый

source: As long as it is 1, the flip-flop's value is pinned to 0.
ru_ru: Пока на нём 1, значение триггера фиксировано на 0.

source: It happens that we'll just use two of them for our XOR circuit; but for other circuits, you may find that having more than two wires going to an AND gate is useful.
ru_ru: Так получилось, что мы используем только два из них для нашей схемы Исключающее ИЛИ; но для других схем вы можете обнаружить, что более чем два провода, идущие к элементу И, могут быть полезны.

source: Save As...
ru_ru: Сохранить как...

source: The following components all have support for the Poke Tool.
ru_ru: Все следующие компоненты имеют поддержку Инструмента Нажатие.

source: In the future, then, that mouse combination would map to whatever tool is currently selected in the toolbar or the explorer pane.
ru_ru: После этого эта комбинация мыши будет использовать инструмент, выбранный в текущий момент на панели инструментов или панели проводника.

source: West edge, north end (input, bit width matches the Data Bits attribute)
ru_ru: Западный край, северный конец (вход, разрядность соответствует атрибуту Биты данных)

source: The enable output is 1 whenever the component is enabled and none of the indexed inputs are 1.
ru_ru: На разрешающем выходе 1, когда компонент включен и ни на одном из нумерованных входов нет 1.

source: Logisim's integrated hex editor
ru_ru: Встроенный шестнадцатеричный редактор Logisim

source: If you have selected one circuit, select the file into which the image should be placed.
ru_ru: Если вы выбрали одну схему, выберите файл, в который изображение должно быть помещено.

source: // also where the helper method is defined.
ru_ru: // там, где объявлен вспомогательный метод.

source: Exactly what the tool does depends on where the user presses the mouse on the canvas.
ru_ru: Что в точности делает инструмент, зависит от того, где на холсте пользователь нажимает мышью.

source: With a loaded Logisim library, you are allowed to view circuits and manipulate their states, but Logisim will prevent you from altering the circuits' design and other data stored within the file.
ru_ru: Для загруженной библиотеке Logisim вам разрешено рассматривать схемы и управлять их состояниями, но Logisim не позволит вам менять чертёж схемы и другие данные, хранящиеся в файле.

source: Beginner's tutorial
ru_ru: Пособие начинающего

source: The menu tool permits the user to pull up a pop-up menu for components that already exist.
ru_ru: Инструмент Меню позволяет пользователю вызвать всплывающее меню для уже существующих компонентов.

source: Of course, you might hope that Logisim would make at least some attempt - perhaps look for flip-flops or cycles in the wires - but it does not.) As a result, the Combinational Analysis system should not be used indiscriminately: Only use it when you are indeed sure that the circuit you are analyzing is indeed combinational!
ru_ru: Конечно, вы можете надеяться, что Logisim сделает по крайней мере некоторые попытки - возможно, поищет триггеры или циклы в проводах - но это не так). В результате, система Комбинационный анализ не должна использоваться без разбора: используйте её только когда вы уверены, что схема, которую вы анализируете, действительно комбинационная!

source: For example, if inputs 0, 2, 5, and 6 are all 1, then the priority encoder emits a value of 110.
ru_ru: Например, если входы 0, 2, 5 и 6 содержат 1, то шифратор приоритетов пускает на выход значение 110.

source: Before we go on, let me briefly describe the Gray code on which these examples are based.
ru_ru: Прежде чем мы продолжим, позвольте мне кратко описать код Грея, на котором основаны эти примеры.

source: If either of the operands contains some floating bits or some error bits, then the component will perform a partial subtraction.
ru_ru: Если какой-либо операнд содержит несколько плавающих битов или несколько битов с ошибкой, то компонент выполнит частичное вычитание.

source: After clicking the component using the poke tool, the user can type characters, which accumulate in a buffer.
ru_ru: После нажатия на компонент с помощью Инструмента Нажатие, пользователь может печатать символы, которые накапливаются в буфере.

source: All actions affect the truth table immediately.
ru_ru: Все действия отражаются на таблице истинности немедленно.

source: Four possible actions are supported:
ru_ru: Четыре возможных действия поддерживаются:

source: Documentation about how they work within a circuit can be found on the RAM and ROM pages of the Library Reference.
ru_ru: Документацию по их работе в схеме можно найти на страницах ОЗУ и ПЗУ справки по библиотеке.

source: Wiring library: Pin, Probe, and Clock components
ru_ru: Библиотека Проводка: компоненты Контакт, Датчик и Тактовый генератор

source: The bit width of the data being routed through the demultiplexer.
ru_ru: Разрядность данных, проходящих через демультиплексор.

source: If it is configured at 0 (which is the default), then the seed is based on the current time; when instructed to reset through the reset input, the component computes a new seed based on the new current time.
ru_ru: Если выбран 0 (по умолчанию), то семя выбирается на основе текущего времени; когда значение сбрасывается с помощью входа сброс, компонент вычисляет новое семя на основе нового текущего времени.

source: these conditions, and telling the user how to view a copy of this
ru_ru: этих условиях, и указывающее пользователю, как просмотреть копию данной

source: Controls the upper horizontal segment.
ru_ru: Управляет верхним горизонтальным сегментом.

source: If sel is 0, then D will be floating.
ru_ru: Если на входе sel 0, то значение на выходе D будет плавающим.

source: Now, we can delete the two existing AND gates and add two new AND gates in their place.
ru_ru: Теперь мы можем удалить два существующих элемента И, и добавить два новых элемента И на их месте.

source: Clicking on a component supporting the Poke Tool, though, will display that component's attributes.
ru_ru: При нажатии на компоненте, поддерживающем Инструмент Нажатие, однако, будут отображены атрибуты компонента.

source: Displays a small grid of pixels, whose values are determined by the current inputs.
ru_ru: Отображает небольшую сетку пикселей, значения которых определяются текущими значениями на входах.

source: Copies the currently selected components in the circuit onto Logisim's clipboard.
ru_ru: Копирует выбранные в схеме компоненты в буфер Logisim.

source: (The unconnected legs of the OR gate will still be blue: That's fine.)
ru_ru: (Неприсоединённые ножки элемента ИЛИ останутся синими: это нормально.)

source: The splitter creates a correspondence between a multi-bit value and several separate subsets of those bits.
ru_ru: Разветвитель задаёт соответствие между многобитным значением и несколькими отдельными подмножествами из этих битов.

source: The bit width of the component's inputs.
ru_ru: Разрядность входа компонента.

source: There is only one instance of
ru_ru: Только один экземпляр

source: I have to leave these suggesters anonymous, because I don't have their permission to mention them here, but: Thank you!
ru_ru: Мне придется оставить этих людей анонимными, потому что я не имею их разрешения упоминать о них здесь, но: спасибо!

source: The Toolbar tab
ru_ru: Вкладка Панель инструментов

source: Note that Logisim's simulation of clocks is quite unrealistic: In real circuits, multiple clocks will drift from one another and will never move in lockstep.
ru_ru: Отмечу, что моделирование тактового генератора в Logisim немного не реалистично: в реальных схемах несколько тактовых генераторов будут смещаться друг относительно друга, и никогда не будут идти нога в ногу.

source: The inputs whose 1 bits are to be counted.
ru_ru: Входы, биты 1 на которых будут подсчитаны.

source: South edge, second from left (input, bit width 1)
ru_ru: Южный край, второй слева (вход, разрядность равна 1)

source: Provides the ability to sort the table in the Get Circuit Statistics dialog through clicking column headers.
ru_ru: Предоставляет возможность сортировки таблицы в диалоге Получить статистику схемы путём щелчка мышью на заголовке столбца.

source: In the below circuit, we have used a splitter to accomplish this: The 8-bit input comes into the splitter, which divides the 8 bits into two 4-bit values, which are then fed into the AND gate and from there to the output.
ru_ru: На схеме ниже мы использовали для этого разветвитель: 8-битный вход подводится к разветвителю, который разделяет 8 битов на два 4-битных значения, которые затем подаются на элемент И, а с него - на выход.

source: Add adds the currently selected item(s) on the left side into the selection.
ru_ru: Добавить добавляет в выборку выделенный в левой области элемент (или несколько).

source: Register
ru_ru: Регистр

source: The first thing we'll do is to add the two AND gates.
ru_ru: Первое, что мы сделаем, это добавим два элемента И.

source: Pins will be placed on the rectangle's border based on their facing: Pins that face east in the layout (and typically appear on the west side of the layout) will be placed on the rectangle's west side, according to their top-down ordering in the layout.
ru_ru: Контакты будут размещены на границе прямоугольника в зависимости от их направления: контакты, направленные на восток на чертеже (и обычно расположенные на западной стороне чертежа) будут размещены на западной стороне прямоугольника в соответствии с их расположением сверху вниз на чертеже.

source: Logisim is an educational tool for designing and simulating digital logic circuits.
ru_ru: Logisim является образовательным инструментом для разработки и моделирования цифровых логических схем.

source: The color with which to draw the label.
ru_ru: Цвет, которым отрисовывается метка.

source: The checkbox is disabled when the current language does not have any equivalents available (as with English).
ru_ru: Флажок отключен, если текущий язык не имеет доступных эквивалентов (например, английский).

source: Selections of a region of text within a label is impossible.
ru_ru: Выделения области текста внутри метки невозможны.

source: Logisim draws little dots on the components to indicate where wires ought to connect.
ru_ru: Logisim отрисовывает маленькие точки на компоненте, чтобы показать, куда подключать провода.

source: The reason for this odd behavior is this: To be consistent with its other behavior, Logisim must immediately merge any wires as soon as they are dropped into a circuit; this merging process changes existing wires in the circuit.
ru_ru: Причина такого странного поведения следующая: для согласования со своим поведением в других ситуациях Logisim должен немедленно объединить все провода, как только они сбрасываются в схему; этот процесс слияния изменяет существующие в схеме провода.

source: The text appearing in the label.
ru_ru: Текст, размещаемый на метке.

source: The -load command-line parameter
ru_ru: Параметр командной строки -load

source: // SimpleGrayCounter object is ever created, and its job is to manage all
ru_ru: // объект SimpleGrayCounter вообще создаётся, и его работа - управлять всеми

source: And there is another output pin corresponding to the two-bit adder's output, so it is the third column.
ru_ru: И есть другой выходной контакт, соответствующий выходу двухбитного сумматора, так что он в третьем столбце.

source: package com.cburch.gray; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Direction; import com.cburch.logisim.instance.InstanceFactory; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.Port; import com.cburch.logisim.util.GraphicsUtil; import com.cburch.logisim.util.StringUtil; /** Manufactures a simple counter that iterates over the 4-bit Gray Code.
ru_ru: package com.cburch.gray; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Direction; import com.cburch.logisim.instance.InstanceFactory; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.Port; import com.cburch.logisim.util.GraphicsUtil; import com.cburch.logisim.util.StringUtil; /** Создаёт простой счётчик, который пробегает по очереди 4-битные коды Грея.

source: Bit Width In
ru_ru: Разрядность входа

source: Shows a dialog containing statistics about components used by the currently viewed circuit.
ru_ru: Показывает диалог, содержащий статистические данные о компонентах, используемых в рассматриваемой схеме.

source: Next: The Edit menu.
ru_ru: Далее: Меню Правка.

source: If you have selected multiple circuits, select a directory where the files should be placed; Logisim will name the images based on the circuits' names (main.png, for example).
ru_ru: Если вы выбрали несколько схем, выберите директорию, куда файлы должны быть помещены; Logisim назовёт изображения, основываясь на названиях схем (main.png например).

source: Guide to Being a Logisim User
ru_ru: Руководство пользователя Logisim

source: When you switch in the project window to viewing another simulation, the file logging is automatically halted; if you return to the original one and want logging to continue, you will need to re-enable the file logging manually using the button at top.
ru_ru: Когда вы переключаетесь в окне проекта на просмотр другого моделирования, запись журнала в файл автоматически останавливается; если вы вернулись к исходному моделированию, и хотите продолжить запись журнала, то вам придётся вручную включить её снова, используя кнопку наверху.

source: East edge, variable number (outputs, bit width 1)
ru_ru: Восточный край, переменное количество (выходы, разрядность равна 1)

source: Substituting libraries
ru_ru: Подстановка библиотек

source: Bit Width Out
ru_ru: Разрядность выхода

source: Background
ru_ru: Фон

source: Note that this occurs only if the problematic bit is encountered before finding the desired bit: For the input x1010100, the output would still be 2 if the lowest-order 1 is desired; but we would get error values if the component's type indicates to search for the highest-order 1 or the highest-order 0, since there is an erroneous bit in a higher-order bit than either the highest-order 0 or the highest-order 1.
ru_ru: Заметьте, что это случается только если проблемный бит встречается до нахождения желаемого бита: для входного значения x1010100 на выходе всё ещё будет 2, если нужен младший 1; но там будут значения ошибки, если тип компонента указывает искать старший 1 или старший 0, поскольку старший бит содержит значение ошибки, а не 0 или 1.

source: All component(s) contained by the rectangle will be placed into the selection.
ru_ru: Все компоненты, находящиеся в прямоугольнике, будут помещены в выделение.

source: Next: Editing subcircuit appearance.
ru_ru: Далее: Изменение внешнего вида подсхемы.

source: Changes the explorer pane to displaying a list of the project's circuits and the libraries that have been loaded.
ru_ru: Изменяет панель проводника для отображения списка схем проекта и загруженных библиотек.

source: If gate is floating or an error value, then the output will be an error value.
ru_ru: Если на затворе плавающее значение, или значение ошибки, то на выходе будет значение ошибки.

source: (The letter X represents the error value, and the letter Z represents the floating value.)
ru_ru: (Буква X обозначает значение ошибки, а буква Z обозначает плавающее значение.)

source: Then you click to indicate the control point's location; shift-click ensures the curve is symmetric, while alt-click draws the curve through the control point.
ru_ru: Затем вы щёлкаете, чтобы указать положение управляющей точки; щелчок с Shift обеспечивает симметрию кривой, а щелчок с Alt рисует кривую через управляющую точку.

source: Shift-dragging the mouse starting at a location not contained within any components initiates a rectangular selection.
ru_ru: Перетаскивание мыши с зажатой клавишей Shift, начинающееся с точки, не находящейся внутри какого-либо компонента, инициирует прямоугольное выделение.

source: Students at colleges and universities around the world use Logisim for a variety of purposes, including:
ru_ru: Учащиеся колледжей и университетов по всему миру используют Logisim для различных целей, в том числе:

source: Now that you are finished with tutorial, you can experiment with Logisim by building your own circuits.
ru_ru: Теперь, когда вы закончили пособие, вы можете экспериментировать с Logisim, строя свои собственные схемы.

source: Other verification options
ru_ru: Другие параметры проверки

source: Editing the truth table
ru_ru: Редактирование таблицы истинности

source: * CounterPoker is a class specific to GrayCounter, and that it must be a
ru_ru: * CounterPoker - это класс, специфичный для GrayCounter, и что он должен быть

source: The color with which to display the button.
ru_ru: Цвет, которым отрисовывается кнопка.

source: Version 2.3.0 introduced the much simpler InstanceFactory API; the older technique is deprecated.)
ru_ru: Версия 2.3.0 вводит гораздо более простой API InstanceFactory; старые приёмы являются устаревшими.)

source: /** Retrieves the state associated with this counter in the circuit state,
ru_ru: /** Получает состояние, связанное с этим счётчиком в состоянии схемы,

source: * would override the method.
ru_ru: * придётся переопределить метод.

source: As an example of this file format, if we had a 256-byte memory whose first five bytes were 2, 3, 0, 20, and -1, and all subsequent values were 0, then the image would be the following text file.
ru_ru: Вот пример этого формата файла. Если бы мы имели 256-байтовую память, чьи первые пять байт 2, 3, 0, 20, и -1, а все последующие значения - 0, то образом был бы следующий текстовый файл.

source: When the knob is pulled to the top, this output's value is 1, and when the knob is pulled to the bottom, the output is the maximum value for the bit width selected.
ru_ru: Когда рукоять поднята вверх, значение этого выхода 1, а когда рукоять опущена вниз, значение выхода равно максимальному значению для выбранной разрядности.

source: It was contributed by Pablo Leal Ramos, from Spain.
ru_ru: Его предоставил Пабло Лил Рамос из Испании.
